"""
Тема 1. Переменные, типы данных и операции

Выполните задания прямо в этом файле.
После каждого задания используйте print(), чтобы увидеть результат.
"""


# Задание 1
# Создайте переменные name, age, city.
# Запишите в них свое имя, возраст и город.
# Выведите каждую переменную на экран.


# TODO: решение
name = "Daria"
age = 18
city = "Moscow"
print(name, age, city)

# Задание 2
# Создайте две переменные a и b с любыми целыми числами.
# Выведите их сумму, разность, произведение и частное.


# TODO: решение
а = 8
b = 2
print(a + b)
print(a - b)
print(a * b)
print(a / b)

# Задание 3
# Создайте переменную temperature со значением 36.6.
# Выведите значение переменной и ее тип.


# TODO: решение
temperature = 36.6
print(temperature)
print(type(temperature))

# Задание 4
# Дана строка number_text = "123".
# Преобразуйте ее в число и прибавьте 7.
# Выведите результат.

number_text = "123"

# TODO: решение
number = int(number_text)
result • number + 7
print (result)

# Задание 5
# Создайте переменные width и height.
# Посчитайте площадь прямоугольника и выведите ее.


# TODO: решение
width = 10
height = 5
area - width * height
print(f"Площадь прямоугольника: {area]")

# Задание 6
# Создайте переменную seconds с количеством секунд.
# Посчитайте, сколько это полных минут и сколько секунд осталось.
# Пример: 125 секунд -> 2 минуты и 5 секунд.


# TODO: решение
seconds = 125
minutes = seconds // 60
remaining_seconds - seconds% 60
printf"(seconds) секунд -> (minutes) минуты и (remaining_seconds) секунд")